Repository: gabrielalaa/Covid_Project
Catalog: covidapp/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Title
ro: Titlu

source: Content
ro: Conținut

source: COVID-19 Dashboard
ro: Panou de control COVID-19

source: COVID-19 Evolution
ro: Evoluția COVID-19

source: Vaccination Progress
ro: Progresul Vaccinării

source: COVID-19 Evolution in Romania
ro: Evoluția COVID-19 în România

source: COVID-19 Plot
ro: Graficul COVID-19

source: Vaccination Progress in Romania
ro: Progresul Vaccinării în România

source: Vaccination Plot
ro: Graficul Vaccinării

source: COVID-19 Insights:
ro: Perspective COVID-19:

source: Average mortality rate is {avg_mortality:.2%}. Total cases are {recent_cases:,}, with {recent_deaths:,} deaths.
ro: Rata medie a mortalității este {avg_mortality:.2%}. Numărul total de cazuri este {recent_cases:,}, cu {recent_deaths:,} decese.

source: It seems the number of deaths is relatively low compared to cases.
ro: Se pare că numărul de decese este relativ scăzut în comparație cu cazurile.

source: The mortality rate is concerning.
ro: Rata mortalității este îngrijorătoare.
